/* 
 * ***************************************************************
 * Filename:      	vapi_vout.c
 * Created at:    	2015.10.21
 * Description:   	video output controller
 * Author:        	zbing
 * Copyright (C)  	milesight
 * ***************************************************************
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <fcntl.h>
#include <errno.h>
#include <pthread.h>
#include <unistd.h>
#include <sys/ioctl.h>
#include "vapi_comm.h"

#define DEV_SUB_HDMI_NAME    "/dev/sil9024"
#define DEV_SUB_VGA_NAME     "/dev/ths8200"

typedef struct ths8200_reg
{
	unsigned char reg;
	unsigned char value;
}the8200_reg_t;

typedef enum ths_mode
{
	THS8200_1920_1080_60Hz_148M = 0,
	THS8200_1920_1080_50Hz_148M,
	THS8200_640_480_60Hz_25M,
	THS8200_800_600_60Hz_40M,
	THS8200_848_480_60Hz_33M,
	THS8200_1024_768_60Hz_65M,
	THS8200_1280_768_60Hz_68M,
	THS8200_1280_768_60Hz_79M,
	THS8200_1280_800_60Hz_71M,
	THS8200_1280_800_60Hz_83M,
	THS8200_1280_960_60Hz_108M,
	THS8200_1280_1024_60Hz_108M,
	THS8200_1360_768_60Hz_85M,
	THS8200_1440_1050_60Hz_101M,
	THS8200_1440_1050_60Hz_121M,
	THS8200_1440_900_60Hz_88M,
	THS8200_1440_900_60Hz_106M,
	THS8200_1600_1200_60Hz_162M,
	THS8200_1600_1050_60Hz_119M,
	THS8200_1600_1050_60Hz_146M,
	THS8200_1920_1200_60Hz_154M,
	THS8200_1366_768_60Hz_85M,
	THS8200_1600_900_60Hz_108M,
	THS8200_2048_1152_60Hz_162M,
	THS8200_1280_720_60Hz_74M,
	THS8200_1368_768_60Hz_72M,
	THS8200_1280_720_60Hz_74M_37K,
}ths_mode_e;

typedef enum sil_mode{
    HDMI_BEGIN = 0,
    HDMI_480I60_4X3 = 1,
    HDMI_576I50_4X3,
    HDMI_480P60_4X3,
    HDMI_576P50_4X3,
    HDMI_720P60,
    HDMI_720P50,
    HDMI_1080I60,
    HDMI_1080I50,
    HDMI_1080P60,
    HDMI_1080P50,
    HDMI_1080P25,
    HDMI_1080P30,
    HDMI_1024_768_60,
    HDMI_1280_1024_60,
    HDMI_800_600_60,
    HDMI_1080P24,
    HDMI_END,
}sil_mode_e;

typedef struct sil_edid{
    int     isValid;
    char    data[512];
}sil_edid_s;


/*
 * ioctl cmd
 */
#define THS8200_IOC_MAGIC		    't'
#define THS8200_GET_ALL_REG			_IO(THS8200_IOC_MAGIC, 1)
#define THS8200_GET_SINGLE_REG		_IOWR(THS8200_IOC_MAGIC, 2, struct ths8200_reg)
#define THS8200_SET_SINGLE_REG		_IOWR(THS8200_IOC_MAGIC, 3, struct ths8200_reg)
#define THS8200_CHOICE_MODE			_IOWR(THS8200_IOC_MAGIC, 4, enum ths_mode)

#define SIL9024_IOC_MAGIC		    's'
#define SIL9024_GET_EDID			_IOWR(SIL9024_IOC_MAGIC, 1, struct sil_edid)
#define SIL9024_GET_SINGLE_REG		_IOWR(SIL9024_IOC_MAGIC, 2, 0)
#define SIL9024_SET_TIMER_POLL		_IOWR(SIL9024_IOC_MAGIC, 3, int)
#define SIL9024_CHOICE_MODE			_IOWR(SIL9024_IOC_MAGIC, 4, enum sil_mode)

/*  Video Descriptor Block  */
typedef struct HDMI_EDID_DTD_VIDEO {
	HI_U16	pixel_clock;		/* 54-55 */
	HI_U8   horiz_active;		/* 56 */
	HI_U8	horiz_blanking;		/* 57 */
	HI_U8	horiz_high;		/* 58 */
	HI_U8	vert_active;		/* 59 */
	HI_U8	vert_blanking;		/* 60 */
	HI_U8	vert_high;		/* 61 */
	HI_U8	horiz_sync_offset;	/* 62 */
	HI_U8	horiz_sync_pulse;	/* 63 */
	HI_U8	vert_sync_pulse;	/* 64 */
	HI_U8	sync_pulse_high;	/* 65 */
	HI_U8	horiz_image_size;	/* 66 */
	HI_U8	vert_image_size;	/* 67 */
	HI_U8	image_size_high;	/* 68 */
	HI_U8	horiz_border;		/* 69 */
	HI_U8	vert_border;		/* 70 */
	HI_U8	misc_settings;		/* 71 */
}HDMI_EDID_DTD_VIDEO_S;

typedef struct HDMI_EDID {
	HI_U8   header[8];		/* 00-07 */
	HI_U16	manufacturerID;		/* 08-09 */
	HI_U16	product_id;		/* 10-11 */
	HI_U32	serial_number;		/* 12-15 */
	HI_U8	week_manufactured;	/* 16 */
	HI_U8	year_manufactured;	/* 17 */
	HI_U8	edid_version;		/* 18 */
	HI_U8	edid_revision;		/* 19 */
	HI_U8	video_in_definition;	/* 20 */
	HI_U8	max_horiz_image_size;	/* 21 */
	HI_U8	max_vert_image_size;	/* 22 */
	HI_U8	display_gamma;		/* 23 */
	HI_U8	power_features;		/* 24 */
	HI_U8	chroma_info[10];	/* 25-34 */
	HI_U8	timing_1;		/* 35 */
	HI_U8	timing_2;		/* 36 */
	HI_U8	timing_3;		/* 37 */
	HI_U8	std_timings[16];	/* 38-53 */

	HDMI_EDID_DTD_VIDEO_S video[4]; /* 54-125 */

	HI_U8	extension_edid;		/* 126 */
	HI_U8	checksum;		/* 127 */
	HI_U8	extension_tag;		/* 00 (extensions follow EDID) */
	HI_U8	extention_rev;		/* 01 */
	HI_U8	offset_dtd;		/* 02 */
	HI_U8	num_dtd;		/* 03 */

	HI_U8	data_block[123];	/* 04 - 126 */
	HI_U8	extension_checksum;	/* 127 */

	HI_U8	ext_datablock[256];
} HDMI_EDID_S;


typedef struct hiHDMI_ARGS_S
{
    HI_HDMI_ID_E enHdmi;
    HI_HDMI_VIDEO_FMT_E eForceFmt;
    VO_INTF_SYNC_E      enIntfSync;
}HDMI_ARGS_S;

typedef struct adaptive_s{
    pthread_t       handle;
    pthread_mutex_t mutex;           
    HI_BOOL         isRun;
    SCREEN_RES_E    enRes[SCREEN_NUM];
}ADAPTIVE_S;

typedef struct voChn_s{
    CHNINFO_S       stChn[VAPI_VO_LAYER_NUM][MAX_CHN_NUM];
    SCREEN_RES_E    enRes[SCREEN_NUM];
    CSC_E           enCSC[VAPI_VO_LAYER_NUM];
    HDMI_ARGS_S     stHdmiArgs;
    SCREEN_E        enPipBind;
    int  (*update_screen_res_cb)(int screen, int res);
    ADAPTIVE_S      stAdapt;
    HI_BOOL         isHotplug;
    HI_BOOL         isDualScreen;
    pthread_mutex_t mutex;  
    
}VOCHN_S;

static VOCHN_S g_stVoChn;

static VO_INTF_SYNC_E vapi_vo_get_srceen_sync(SCREEN_RES_E enRes)
{
    VO_INTF_SYNC_E enIntfSync;

