/*
 * ***************************************************************
 * Filename:      	vapi_vout.c
 * Created at:    	2015.10.21
 * Description:   	video output controller
 * Author:        	zbing
 * Copyright (C)  	milesight
 * ***************************************************************
 */

#include "vapi_comm.h"
#include <errno.h>
#include <fcntl.h>
#include <pthread.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/ioctl.h>
#include <unistd.h>

#define DEV_SUB_HDMI_NAME "/dev/sil9024"
#define DEV_SUB_VGA_NAME  "/dev/ths8200"

typedef struct ths8200_reg
{
    unsigned char reg;
    unsigned char value;
} the8200_reg_t;

typedef enum ths_mode
{
    THS8200_1920_1080_60Hz_148M = 0,
    THS8200_1920_1080_50Hz_148M,
    THS8200_640_480_60Hz_25M,
    THS8200_800_600_60Hz_40M,
    THS8200_848_480_60Hz_33M,
    THS8200_1024_768_60Hz_65M,
    THS8200_1280_768_60Hz_68M,
    THS8200_1280_768_60Hz_79M,
    THS8200_1280_800_60Hz_71M,
    THS8200_1280_800_60Hz_83M,
    THS8200_1280_960_60Hz_108M,
    THS8200_1280_1024_60Hz_108M,
    THS8200_1360_768_60Hz_85M,
    THS8200_1440_1050_60Hz_101M,
    THS8200_1440_1050_60Hz_121M,
    THS8200_1440_900_60Hz_88M,
    THS8200_1440_900_60Hz_106M,
    THS8200_1600_1200_60Hz_162M,
    THS8200_1600_1050_60Hz_119M,
    THS8200_1600_1050_60Hz_146M,
    THS8200_1920_1200_60Hz_154M,
    THS8200_1366_768_60Hz_85M,
    THS8200_1600_900_60Hz_108M,
    THS8200_2048_1152_60Hz_162M,
    THS8200_1280_720_60Hz_74M,
    THS8200_1368_768_60Hz_72M,
    THS8200_1280_720_60Hz_74M_37K,
} ths_mode_e;

typedef enum sil_mode
{
    HDMI_BEGIN      = 0,
    HDMI_480I60_4X3 = 1,
    HDMI_576I50_4X3,
    HDMI_480P60_4X3,
    HDMI_576P50_4X3,
    HDMI_720P60,
    HDMI_720P50,
    HDMI_1080I60,
    HDMI_1080I50,
    HDMI_1080P60,
    HDMI_1080P50,
    HDMI_1080P25,
    HDMI_1080P30,
    HDMI_1024_768_60,
    HDMI_1280_1024_60,
    HDMI_800_600_60,
    HDMI_1080P24,
    HDMI_END,
} sil_mode_e;

typedef struct sil_edid
{
    int  isValid;
    char data[512];
} sil_edid_s;

/*
 * ioctl cmd
 */
#define THS8200_IOC_MAGIC      't'
#define THS8200_GET_ALL_REG    _IO(THS8200_IOC_MAGIC, 1)
#define THS8200_GET_SINGLE_REG _IOWR(THS8200_IOC_MAGIC, 2, struct ths8200_reg)
#define THS8200_SET_SINGLE_REG _IOWR(THS8200_IOC_MAGIC, 3, struct ths8200_reg)
#define THS8200_CHOICE_MODE    _IOWR(THS8200_IOC_MAGIC, 4, enum ths_mode)

#define SIL9024_IOC_MAGIC      's'
#define SIL9024_GET_EDID       _IOWR(SIL9024_IOC_MAGIC, 1, struct sil_edid)
#define SIL9024_GET_SINGLE_REG _IOWR(SIL9024_IOC_MAGIC, 2, 0)
#define SIL9024_SET_TIMER_POLL _IOWR(SIL9024_IOC_MAGIC, 3, int)
#define SIL9024_CHOICE_MODE    _IOWR(SIL9024_IOC_MAGIC, 4, enum sil_mode)

/*  Video Descriptor Block  */
typedef struct HDMI_EDID_DTD_VIDEO
{
    td_u16 pixel_clock;       /* 54-55 */
    td_u8  horiz_active;      /* 56 */
    td_u8  horiz_blanking;    /* 57 */
    td_u8  horiz_high;        /* 58 */
    td_u8  vert_active;       /* 59 */
    td_u8  vert_blanking;     /* 60 */
    td_u8  vert_high;         /* 61 */
    td_u8  horiz_sync_offset; /* 62 */
    td_u8  horiz_sync_pulse;  /* 63 */
    td_u8  vert_sync_pulse;   /* 64 */
    td_u8  sync_pulse_high;   /* 65 */
    td_u8  horiz_image_size;  /* 66 */
    td_u8  vert_image_size;   /* 67 */
    td_u8  image_size_high;   /* 68 */
    td_u8  horiz_border;      /* 69 */
    td_u8  vert_border;       /* 70 */
    td_u8  misc_settings;     /* 71 */
} HDMI_EDID_DTD_VIDEO_S;

typedef struct HDMI_EDID
{
    td_u8  header[8];            /* 00-07 */
    td_u16 manufacturerID;       /* 08-09 */
    td_u16 product_id;           /* 10-11 */
    td_u32 serial_number;        /* 12-15 */
    td_u8  week_manufactured;    /* 16 */
    td_u8  year_manufactured;    /* 17 */
    td_u8  edid_version;         /* 18 */
    td_u8  edid_revision;        /* 19 */
    td_u8  video_in_definition;  /* 20 */
    td_u8  max_horiz_image_size; /* 21 */
    td_u8  max_vert_image_size;  /* 22 */
    td_u8  display_gamma;        /* 23 */
    td_u8  power_features;       /* 24 */
    td_u8  chroma_info[10];      /* 25-34 */
    td_u8  timing_1;             /* 35 */
    td_u8  timing_2;             /* 36 */
    td_u8  timing_3;             /* 37 */
    td_u8  std_timings[16];      /* 38-53 */

    HDMI_EDID_DTD_VIDEO_S video[4]; /* 54-125 */

    td_u8 extension_edid; /* 126 */
    td_u8 checksum;       /* 127 */
    td_u8 extension_tag;  /* 00 (extensions follow EDID) */
    td_u8 extention_rev;  /* 01 */
    td_u8 offset_dtd;     /* 02 */
    td_u8 num_dtd;        /* 03 */

    td_u8 data_block[123];    /* 04 - 126 */
    td_u8 extension_checksum; /* 127 */

    td_u8 ext_datablock[256];
} HDMI_EDID_S;

typedef struct hiHDMI_ARGS_S
{
    ot_hdmi_id           enHdmi;
    ot_hdmi_video_format eForceFmt;
    ot_vo_intf_sync      enIntfSync;
    ot_vo_intf_type      enIntfType;
    SCREEN_E             enScreen;
    DEV_E                enDev;
} HDMI_ARGS_S;

typedef struct adaptive_s
{
    pthread_t       handle;
    pthread_mutex_t mutex;
    td_bool         isRun;
    SCREEN_RES_E    enRes[SCREEN_NUM];
} ADAPTIVE_S;

typedef struct voChn_s
{
    CHNINFO_S    stChn[VAPI_VO_LAYER_NUM][MAX_CHN_NUM];
    SCREEN_RES_E enRes[SCREEN_NUM];
    CSC_E        enCSC[VAPI_VO_LAYER_NUM];
    HDMI_ARGS_S  stHdmiArgs[VAPI_VO_DEV_NUM];
    SCREEN_E     enPipBind;
    int (*update_screen_res_cb)(int screen, int res);
    ADAPTIVE_S      stAdapt;
    td_bool         isHotplug;
    td_bool         isDualScreen;
    td_bool         isogeny;
    pthread_mutex_t mutex;

} VOCHN_S;

