/* 
 * ***************************************************************
 * Filename:      	vapi_vout.c
 * Created at:    	2016.04.29
 * Description:   	video output controller
 * Author:        	zbing
 * Copyright (C)  	milesight
 * ***************************************************************
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <fcntl.h>
#include <errno.h>
#include <pthread.h>
#include <unistd.h>
#include <sys/ioctl.h>
#include "vapi_comm.h"

/*  Video Descriptor Block  */
typedef struct HDMI_EDID_DTD_VIDEO {
	HI_U16	pixel_clock;		/* 54-55 */
	HI_U8   horiz_active;		/* 56 */
	HI_U8	horiz_blanking;		/* 57 */
	HI_U8	horiz_high;		/* 58 */
	HI_U8	vert_active;		/* 59 */
	HI_U8	vert_blanking;		/* 60 */
	HI_U8	vert_high;		/* 61 */
	HI_U8	horiz_sync_offset;	/* 62 */
	HI_U8	horiz_sync_pulse;	/* 63 */
	HI_U8	vert_sync_pulse;	/* 64 */
	HI_U8	sync_pulse_high;	/* 65 */
	HI_U8	horiz_image_size;	/* 66 */
	HI_U8	vert_image_size;	/* 67 */
	HI_U8	image_size_high;	/* 68 */
	HI_U8	horiz_border;		/* 69 */
	HI_U8	vert_border;		/* 70 */
	HI_U8	misc_settings;		/* 71 */
}HDMI_EDID_DTD_VIDEO_S;

typedef struct HDMI_EDID {
	HI_U8   header[8];		/* 00-07 */
	HI_U16	manufacturerID;		/* 08-09 */
	HI_U16	product_id;		/* 10-11 */
	HI_U32	serial_number;		/* 12-15 */
	HI_U8	week_manufactured;	/* 16 */
	HI_U8	year_manufactured;	/* 17 */
	HI_U8	edid_version;		/* 18 */
	HI_U8	edid_revision;		/* 19 */
	HI_U8	video_in_definition;	/* 20 */
	HI_U8	max_horiz_image_size;	/* 21 */
	HI_U8	max_vert_image_size;	/* 22 */
	HI_U8	display_gamma;		/* 23 */
	HI_U8	power_features;		/* 24 */
	HI_U8	chroma_info[10];	/* 25-34 */
	HI_U8	timing_1;		/* 35 */
	HI_U8	timing_2;		/* 36 */
	HI_U8	timing_3;		/* 37 */
	HI_U8	std_timings[16];	/* 38-53 */

	HDMI_EDID_DTD_VIDEO_S video[4]; /* 54-125 */

	HI_U8	extension_edid;		/* 126 */
	HI_U8	checksum;		/* 127 */
	HI_U8	extension_tag;		/* 00 (extensions follow EDID) */
	HI_U8	extention_rev;		/* 01 */
	HI_U8	offset_dtd;		/* 02 */
	HI_U8	num_dtd;		/* 03 */

	HI_U8	data_block[123];	/* 04 - 126 */
	HI_U8	extension_checksum;	/* 127 */

	HI_U8	ext_datablock[256];
} HDMI_EDID_S;


typedef struct hiHDMI_ARGS_S
{
    HI_UNF_HDMI_ID_E enHdmi;
    HI_UNF_ENC_FMT_E enFormat;
}HDMI_ARGS_S;

typedef struct adaptive_s{
    pthread_t       handle;
    pthread_mutex_t mutex;           
    HI_BOOL         isRun;
    SCREEN_RES_E    enRes[SCREEN_NUM];
}ADAPTIVE_S;

typedef struct voChn_s{
    CHNINFO_S       stChn[VAPI_VO_DEV_NUM][MAX_CHN_NUM];
    HI_HANDLE       handle[VAPI_VO_DEV_NUM][MAX_CHN_NUM];
    SCREEN_RES_E    enRes[SCREEN_NUM];
    CSC_E           enCSC[VAPI_VO_DEV_NUM];
    HDMI_ARGS_S     stHdmiArgs;
    int  (*update_screen_res_cb)(int screen, int res);
    ADAPTIVE_S      stAdapt;
    HI_BOOL         isHotplug;
    HI_BOOL         isQuick;
}VOCHN_S;

#define DEV_HDMI2VGA_NAME           "/dev/hi_vga"
#define VGA_SET_MODE_NORMAL         _IO('A', 1) 
#define VGA_SET_MODE_4k             _IO('A', 2) 
